Repository: nextgis/nextgisweb
Catalog: nextgisweb/feature_attachment/locale/*.po
Languages: ru

source: Feature attachments
ru: Прикрепленные к объектам файлы

source: Attachment not found
ru: Вложение не найдено

source: Attachment with id = %d was not found in feature with id = %d.
ru: Вложение с id = %d не найдено в объекте с id = %d.

source: The attachment may have been deleted or an error in the address.
ru: Вложение могло быть удалено, либо допущена ошибка в адресе.

source: Attachments
ru: Вложения

source: Draw the geometry on the map to visualize the attachments to the objects
ru: Нарисуйте геометрию на карте, чтобы отобразить вложения к объектам.

source: Object:
ru: Объект:

source: Identify object
ru: Идентифицировать объект

source: Attachments:
ru: Вложений:

source: No attachments
ru: Нет вложений

source: Download all attachments
ru: Скачать все вложения

source: File name
ru: Имя файла

source: Size
ru: Размер

source: Description
ru: Описание

source: Use export to copy feature attachments between different layers or to create a backup. The resulting ZIP archive will contain all of the attachments put in directories named after feature IDs. Attachment metadata are put into a separate JSON file.
ru: Используйте экспорт для копирования вложений между разными слоями или для создания резервной копии. Полученный ZIP-архив будет содержать все вложения в директориях с именами объектов. Метаданные вложений сохраняются в отдельном JSON-файле.

source: Export attachments to ZIP archive
ru: Экспортировать вложения в ZIP-архив

source: Back to resource
ru: Назад к ресурсу

source: Close
ru: Закрыть

source: The archive has been successfully imported.
ru: Импорт архива выполнен успешно.

source: Attachments imported - {i}, skipped - {s}.
ru: Импортировано вложений - {i}, пропущено - {s}.

source: Upload a ZIP archive to batch append attachments to existing features. An archive must contain directories named after feature IDs. Each folder can contain one or many attachments. Duplicates will be ignored.
ru: Загрузите ZIP-архив для пакетного добавления вложений к существующим объектам. Архив должен содержать директории названные по идентификаторам объектов. Каждая директория может содержать одно или несколько вложений. Дубликаты будут пропущены.

source: Delete existing attachments
ru: Удалить существующие вложения

source: Import attachments from ZIP archive
ru: Импортировать вложения из ZIP-архива.

source: Export
ru: Экспорт

source: Import
ru: Импорт

source: Unnamed
ru: Безымянный

source: MIME type
ru: Тип MIME

source: Toggle panorama viewer
ru: Переключить просмотр панорам

source: Show less
ru: Скрыть

source: Show more
ru: Показать полностью

source: Invalid ZIP archive.
ru: Некорректный ZIP-архив.

source: File '{}' isn't found in metadata.
ru: Файл '{}' не найден в метаданных.

source: Invalid feature ID for file '{}'.
ru: Некорректный идентификатор объекта для файла '{}'.

source: Invalid keyname for file '{}'.
ru: Некорректный ключ для файла '{}'.

source: Invalid name for file '{}'.
ru: Некорректное имя для файла '{}'.

source: Invalid MIME type for file '{}'.
ru: Некорректный MIME-тип для файла '{}'.

source: Invalid description for file '{}'.
ru: Некорректное описание для файла '{}'.

source: Could not determine feature ID for file '{}'.
ru: Не удалось определить идентификатор объекта для файла '{}'.

source: File '{}' isn't found in the archive.
ru: Файл '{}' не найден в архиве.

source: Manage attachments
ru: Управление вложениями
