Repository: nextgis/nextgisweb
Catalog: nextgisweb/locale/*/LC_MESSAGES/raster_layer.po
Languages: ru

source: Output format is not provided.
ru: Выходной формат не указан.

source: Format '%s' is not supported.
ru: Формат '%s' не поддерживается.

source: Raster layer
ru: Растровый слой

source: GDAL library was unable to open the file.
ru: Библиотеке GDAL не удалось открыть файл.

source: Raster has format '%(format)s', however only following formats are supported: %(all_formats)s.
ru: Формат загруженного растра '%(format)s', однако поддерживаются только следующие типы: %(all_formats)s.

source: Raster files without projection info are not supported.
ru: Растровые файлы без информации о проекции не поддерживаются.

source: Complex data types are not supported.
ru: Комплексные типы данных не поддерживаются.

source: Data type
ru: Тип данных

source: Save as
ru: Сохранить как

source: Format
ru: Формат

source: SRS
ru: Система координат

source: Save
ru: Сохранить

source: Select a dataset
ru: Выберите растровый слой

source: Dataset should be in GeoTIFF format.
ru: Файл должен быть в формате GeoTIFF.

source: Coordinate system
ru: Система координат
