Repository: nextgis/nextgisweb
Catalog: nextgisweb/feature_layer/locale/*.po
Languages: ru

source: Geometry is not valid.
ru: Невалидная геометрия

source: Unknown spatial reference system
ru: Неизвестная система координат

source: Parameter 'intersects' geometry is not valid.
ru: Параметр 'intersects' содержит невалидную геометрию.

source: Couldn't add FID field '{}'. Such field already exists.
ru: Не удалось добавить поле FID '{}'. Такое поле уже существует.

source: The export limit is set to {limit} features, but the layer contains {count}.
ru: Лимит экспорта составляет {limit} объектов, однако слой содержит {count}.

source: Failed to reproject 'intersects' geometry.
ru: Не удалось перепроецировать геометрию 'intersects'.

source: Filter expressions are not supported.
ru: Выражения фильтра не поддерживаются.

source: File name parameter '{}' is not valid.
ru: Недопустимое имя файла '{}'.

source: Got an invalid date-time value in the legacy format: {}.
ru: Получено некорректное значение даты-времени в устаревшем формате: {}.

source: Please use dt_format=iso and ISO-8601 based format.
ru: Пожалуйста, используйте dt_format=iso и формат, основанный на ISO-8601.

source: Got an invalid date-time value in ISO-8601 format: {}.
ru: Получено некорректное значение даты-времени в формате ISO-8601: {}.

source: Value should be in RFC 3339 {} format without timezone and leap seconds.
ru: Значение должно быть в формате RFC 3339 {} без часового пояса и секунд координации.

source: Feature not found
ru: Объект не найден

source: Feature with id = %d was not found in resource with id = %d.
ru: Объект с id = %d не найден в ресурсе с id = %d.

source: The feature may have been deleted or an error in the address.
ru: Объект мог быть удалён, либо допущена ошибка в адресе.

source: Feature not deleted
ru: Объект не удален

source: Unable to restore the #{} feature as it is not deleted.
ru: Невозможно восстановить объект #{} поскольку он не удален.

source: Feature table
ru: Таблица объектов

source: Invalid filter expression
ru: Некорректное выражение фильтра

source: Field not found (ID=%d).
ru: Поле не найдено (ID=%d).

source: Versioning not supported
ru: Версионирование не поддерживается

source: Set field value to NULL (No data)
ru: Установить для атрибута значение NULL (Нет данных)

source: There are no attributes in the vector layer
ru: В векторном слое нет атрибутов

source: Attributes
ru: Атрибуты

source: Resources
ru: Ресурсы

source: Format
ru: Формат

source: SRS
ru: Система координат

source: Encoding
ru: Кодировка

source: FID field
ru: Поле FID

source: Use field display names instead of keynames
ru: Использовать наименования полей вместо ключей

source: Fields
ru: Поля

source: Limit by extent
ru: Ограничить охватом

source: Filter text
ru: Текстовый фильтр

source: Filter applied
ru: Фильтр применен

source: Set filter
ru: Установить фильтр

source: Filter
ru: Фильтр

source: Zip archive
ru: Zip архив

source: Save
ru: Сохранить

source: Cancel
ru: Отмена

source: Are you sure?
ru: Вы уверены?

source: Unsaved changes will be lost if you close the window.
ru: Несохраненные изменения будут потеряны, если вы закроете окно.

source: Loading...
ru: Загрузка...

source: Reset
ru: Сбросить

source: Feature saved
ru: Объект сохранен

source: No changes to save
ru: Внесите изменения, чтобы сохранить их

source: Constructor
ru: Конструктор

source: Apply
ru: Применить

source: Clear
ru: Очистить

source: Filter is invalid. Please fix errors before applying.
ru: Фильтр некорректный. Пожалуйста, исправьте ошибки перед применением.

source: Filter applied successfully
ru: Фильтр применен успешно

source: Failed to apply filter
ru: Не удалось применить фильтр

source: Failed to generate JSON from filter state:
ru: Ошибка при генерации JSON из состояния фильтра:

source: Failed to parse JSON, falling back to JSON tab.
ru: Ошибка при парсинге JSON, возвращаемся к вкладке JSON.

source: Cannot delete the root group.
ru: Невозможно удалить корневую группу.

source: Failed to parse filter expression:
ru: Ошибка при парсинге выражения фильтра:

source: Invalid filter value
ru: Некорректное значение фильтра

source: Invalid JSON or filter structure
ru: Некорректный JSON или структура фильтра

source: Validation failed
ru: Ошибка валидации

source: Delete condition
ru: Удалить условие

source: No value
ru: Нет значения

source: Any value
ru: Любое значение

source: Invalid field
ru: Некорректное поле

source: Field not found
ru: Поле не найдено

source: Enter values and press Enter
ru: Введите значения и нажмите Enter

source: Enter integer
ru: Введите целое число

source: Enter big integer
ru: Введите большое целое число

source: Enter number
ru: Введите число

source: Select date
ru: Выберите дату

source: Select time
ru: Выберите время

source: Select date and time
ru: Выберите дату и время

source: Enter value
ru: Введите значение

source: Select field
ru: Выберите поле

source: Operator
ru: Оператор

source: ALL
ru: ВСЕ

source: ANY
ru: ЛЮБОЙ

source: Condition
ru: Условие

source: Group
ru: Группа

source: Output JSON
ru: Вывод JSON

source: Current filter state
ru: Текущее состояние фильтра

source: Equal
ru: Равно

source: Not equal
ru: Не равно

source: Greater
ru: Больше

source: Less
ru: Меньше

source: Greater or equal
ru: Больше или равно

source: Less or equal
ru: Меньше или равно

source: In list
ru: В списке

source: Not in list
ru: Не в списке

source: Is NULL
ru: NULL

source: Is not NULL
ru: Не NULL

source: Field '{fieldName}' expects a string for {fieldType}, but got '{valueType}'
ru: Поле '{fieldName}' ожидает строку для типа {fieldType}, но получено '{valueType}'

source: Field '{fieldName}' expects {fieldType} format '{expectedFormat}', but got '{value}'
ru: Поле '{fieldName}' ожидает тип {fieldType} в формате '{expectedFormat}', но получено '{value}'

source: Condition expression must be an array
ru: Выражение условия должно быть массивом

source: Invalid operator: '{operator}'
ru: Некорректный оператор: '{operator}'

source: Operator '{operator}' expects 1 argument, but got '{length}'
ru: Оператор '{operator}' ожидает 1 аргумент, но получено '{length}'

source: Operator '{operator}' expects at least {min} value argument
ru: Оператор '{operator}' ожидает хотя бы {min} аргумент

source: Field expression must be ['get', fieldName]
ru: Выражение поля должно быть ['get', fieldName]

source: Field name must be a string
ru: Имя поля должно быть строкой

source: Unknown field: '{fieldName}'
ru: Неизвестное поле: '{fieldName}'

source: Operator '{operator}' is not supported for field type '{fieldType}'
ru: Оператор '{operator}' не поддерживается для типа поля '{fieldType}'

source: Values for 'in' operator cannot be arrays (must be flattened) or property references.
ru: Значения для оператора 'in' не могут быть массивами (должны быть развернутыми) или ссылками на свойства.

source: Field '{fieldName}' expects a number, but got '{valueType}'
ru: Поле '{fieldName}' ожидает число, но получено '{valueType}'

source: Field '{fieldName}' expects a string, but got '{valueType}'
ru: Поле '{fieldName}' ожидает строку, но получено '{valueType}'

source: Expression must be an array
ru: Выражение должно быть массивом

source: Group operator must have at least one argument
ru: Групповой оператор должен иметь хотя бы один аргумент

source: All arguments to group operator must be arrays
ru: Все аргументы группового оператора должны быть массивами

source: Unknown or invalid root operator: '{operator}'
ru: Неизвестный или некорректный корневой оператор: '{operator}'

source: Open table settings
ru: Открыть настройки таблицы

source: Refresh table
ru: Обновить таблицу

source: Open
ru: Открыть

source: Open on a new page
ru: Открывать на новой странице

source: Delete
ru: Удалить

source: Edit
ru: Редактировать

source: Edit on a new page
ru: Редактировать на новой странице

source: Create
ru: Создать

source: Search...
ru: Поиск...

source: Advanced filter
ru: Расширенный фильтр

source: Last changed
ru: Последнее изменение

source: Save as
ru: Сохранить как

source: Advanced export
ru: Расширенный экспорт

source: Quick export
ru: Быстрый экспорт

source: Filters are applied
ru: Применяются фильтры

source: Display name
ru: Наименование

source: Keyname
ru: Ключ

source: Type
ru: Тип

source: Lookup table
ru: Справочник

source: Text search
ru: Текстовый поиск

source: Label attribute
ru: Атрибут наименование

source: Please select
ru: Выберите тип

source: Not used
ru: Не используется

source: Delete field?
ru: Удалить поле?

source: Deleting this field will permanently erase all its version history from this layer.
ru: Удаление этого поля навсегда сотрёт всю его историю версий в этом слое.

source: Field
ru: Поле

source: {filtered_count} of {total_count}
ru: {filtered_count} из {total_count}

source: Feature count
ru: Количество объектов

source: Geometry
ru: Геометрия

source: Zoom to layer extent
ru: Перейти к охвату слоя

source: Load geometry info...
ru: Загрузка информации...

source: Failed to get information about the geometry
ru: Не удалось получить информацию о геометрии

source: Perimeter
ru: Периметр

source: Length
ru: Длина

source: Area
ru: Площадь

source: Geometry type
ru: Тип геометрии

source: Extent (xMin)
ru: Охват (xMin)

source: Extent (yMin)
ru: Охват (yMin)

source: Extent (xMax)
ru: Охват (xMax)

source: Extent (yMax)
ru: Охват (yMax)

source: Table
ru: Таблица

source: Feature versioning
ru: Версионирование объектов

source: Disable feature versioning?
ru: Отключить версионирование объектов?

source: Turning off feature versioning will truncate the history and keep only the latest state.
ru: Отключение версионирования приведет к усечению истории и сохранению только последнего состояния.

source: Settings
ru: Настройки

source: Today
ru: Сегодня

source: Yesterday
ru: Вчера

source: Last 24 hours
ru: За 24 часа

source: Last 3 days
ru: За 3 дня

source: Last week
ru: За неделю

source: Last month
ru: За месяц

source: This month
ru: Этот месяц

source: Previous month
ru: Предыдущий месяц

source: Group edits
ru: Группировать правки

source: Created
ru: Добавлен

source: Updated
ru: Изменен

source: Deleted
ru: Удален

source: Restored
ru: Восстановлен

source: Updated geometry
ru: Изменена геометрия

source: Updated {} attribute
ru: Изменен {} атрибут

source: {} attribute
ru: {} атрибут

source: and
ru: и

source: Feature
ru: Объект

source: Action
ru: Действие

source: {dn} copy
ru: Копия {dn}

source: Create copy in
ru: Создать копию в

source: Create copy
ru: Создать копию

source: Reverted
ru: Восстановлено

source: Confirmation required
ru: Требуется подтверждение

source: Please confirm reversion of the layer to version {timestamp} by {author}. This will revert all feature changes made after {timestamp}, but the changes will be kept in the history.
ru: Пожалуйста, подтвердите восстановление слоя до версии {timestamp} от {author}. Это отменит все изменения объектов, внесенные после {timestamp}, однако изменения останутся в истории.

source: Revert
ru: Восстановить

source: Revert to this version
ru: Восстановить до этой версии

# column
source: Created
ru: Добавлено

# column
source: Updated
ru: Изменено

# column
source: Deleted
ru: Удалено

# column
source: Restored
ru: Восстановлено

source: Date and time
ru: Дата и время

source: User
ru: Пользователь

source: Features
ru: Объекты

source: Select the default feature versioning setting for new layers. This affects layers created via UI and HTTP API. You can always change the versioning setting for individual layers later.
ru: Выберите настройку версионирования объектов по умолчанию для новых слоёв. Это влияет на слои, создаваемые через UI и HTTP API. Вы всегда сможете изменить настройку версионирования для отдельных слоёв позже.

source: Auto: follow system-wide settings
ru: Авто: следовать общесистемным настройкам

source: Enable feature versioning by default
ru: Включить версионирование объектов по умолчанию

source: Disable feature versioning by default
ru: Отключить версионирование объектов по умолчанию

source: The setting is saved.
ru: Настройка сохранена.

source: The value must be within the inclusive range of {min} to {max}.
ru: Значение должно находиться в диапазоне от {min} до {max} включительно.

source: Got an invalid INTEGER value: {}.
ru: Получено некорректное значение INTEGER: {}.

source: Got an invalid BIGINT value: {}.
ru: Получено некорректное значение BIGINT: {}.

source: Transaction not found
ru: Транзакция не найдена

source: Operation conflict in transaction
ru: Конфликт операций в транзакции

source: Transaction not committed
ru: Транзакция не зафиксирована

source: Not implemented for feature versioning
ru: Не реализовано для версионирования объектов

source: This operation cannot be performed on a resource with feature versioning enabled. Disable feature versioning for the resource first, and then try again.
ru: Операция не может быть выполнена для ресурса с включенным версионированием объектов. Отключите версионирование и повторите попытку.

source: Feature versioning required
ru: Требуется версионирование объектов

source: Feature versioning is not supported for this resource.
ru: Версионирование объектов не поддерживается для этого ресурса.

source: Feature versioning is not enabled for this resource.
ru: Версионирование объектов не включено для этого ресурса.

source: Epoch required
ru: Требуется эпоха

source: Epoch mismatch
ru: Несооответствие эпох

source: Version out of range
ru: Версия за пределами диапазона

source: Invalid range
ru: Некорректный диапазон

source: Feature #%d
ru: Объект #%d

source: Version history
ru: История изменений

source: MVT Vector Tiles
ru: Векторные тайлы MVT

source: The Mapbox Vector Tile is an efficient encoding for map data into vector tiles that can be rendered dynamically.
ru: Векторные тайлы MVT это эффективное кодирование данных карты в векторные тайлы которые могут быть динамически отрисованы.
