Repository: nextgis/nextgisweb
Catalog: nextgisweb/pyramid/locale/*.po
Languages: ru

source: Storage management is not enabled on this server.
ru: Управление хранилищем не включено на этом сервере.

source: Invalid font file name: '{}'. Only latin letters, digits, hyphens and underscores are allowed. The *.ttf or *.otf extension is required.
ru: Недопустимое имя файла шрифта: '{}'. Разрешены только латинские буквы, цифры, дефисы и подчеркивания. Требуется расширение *.ttf или *.otf.

source: Font '{0}' is larger than {1} bytes.
ru: Шрифт '{0}' больше {1} байт.

source: The '{}' query parameter should not contain additional values if 'all' is specified.
ru: Параметр запроса '{}' не должен содержать дополнительных значений, если указано 'all'.

source: Got an unsupported MIME type: '{}'.
ru: Получен неподдерживаемый тип MIME: '{}'.

source: 64K should be enough for a logo.
ru: 64K должно быть достаточно для логотипа.

source: Your Web GIS at nextgis.com
ru: Ваши карты онлайн на nextgis.com

source: Request timeout
ru: Таймаут запроса

source: Enabled
ru: Включено

source: Disabled
ru: Отключено

source: Internal server error
ru: Внутренняя ошибка сервера

source: The server encountered an internal error or misconfiguration and was unable to complete your request.
ru: При обработке запроса возникла внутренняя ошибка или сервер настроен некорректно и не может обработать запрос.

source: Bad request
ru: Некорректный запрос

source: The server could not comply with the request since it is either malformed or otherwise incorrect.
ru: Сервер не может выполнить запрос. Возможно, в запросе ошибка.

source: Payment required
ru: Необходима оплата

source: Access was denied for financial reasons.
ru: Доступ закрыт по финансовым причинам.

source: Forbidden
ru: Доступ запрещен

source: Access was denied to this resource.
ru: У вас нет доступа к этому ресурсу.

source: Page not found
ru: Страница не найдена

source: The page may have been deleted or an error in the address. Correct the address or go to the home page and try to find the desired page.
ru: Возможно, страница удалена либо в адресе допущена ошибка. Исправьте адрес или вернитесь на главную страницу и попробуйте найти нужную страницу с помощью навигации.

source: Unprocessable entity
ru: Необрабатываемая сущность

source: Unable to process the contained instructions.
ru: Невозможно выполнить запрошенную операцию.

source: Not implemented
ru: Не реализовано

source: Service unavailable
ru: Сервис недоступен

source: The server is currently unavailable. Please try again at a later time.
ru: В настоящий момент сервер недоступен. Пожалуйста, попробуйте выполнить действие еще раз через некоторое время.

source: Lunkwill not enabled
ru: Lunkwill не включен

source: The Lunkwill extension is not configured on this server.
ru: Расширение Lunkwill не настроено на этом сервере.

source: Something went wrong.
ru: Что-то пошло не так.

source: Unknown API error
ru: Неизвестная ошибка API

source: There is no response from the server or problem connecting to server.
ru: Не удалось получить ответ от сервера либо в процессе соединения возникла ошибка.

source: Network error
ru: Сетевая ошибка

source: Check network connectivity and try again later.
ru: Проверьте сетевое соединение и попробуйте повторить позже.

source: Unexpected server response
ru: Неожидаемый ответ сервера

source: Unexpected error while processing long-running request.
ru: Неожиданная ошибка во время выполнения длительного запроса.

source: Long-running request error
ru: Ошибка длительного запроса

source: Long-running request was cancelled.
ru: Длительный запрос был отменен.

source: Filename
ru: Имя файла

source: Timestamp (UTC)
ru: Время (UTC)

source: Size
ru: Размер

source: Enter allowed origins for cross domain requests to use HTTP API of this Web GIS on other websites. One origin per line.
ru: Введите перечень допустимых источников для кросс-доменных запросов для использования HTTP API этой Веб ГИС на других веб-сайтах. По одному источнику в строке.

source: Please note that different protocols (HTTP and HTTPS) and subdomains (example.com and www.example.com) are different origins. Wildcards are allowed for third-level domains and higher.
ru: Имейте в виду, что разные протоколы (HTTP и HTTPS) и субдомены (example.com и www.example.com) считаются разными источниками. Символ подстановки (*) допустим для доменов третьего уровня и выше.

source: CORS settings updated
ru: Настройки CORS обновлены

source: Fix the form errors first
ru: Вначале исправьте ошибку в форме

source: The value entered is not valid
ru: Введенное значение некорректно

source: Custom styles saved. Reload the page to get them applied.
ru: Изменения в стилях сохранены. Обновите страницу, чтобы увидеть изменения.

source: Enter custom CSS rules here. They will be used to redefine styles, design for all pages of your Web GIS.
ru: Здесь можно задать стили CSS. Они будут использованы для оформления всех страниц вашей Веб ГИС.

source: During operation, the Web GIS will restart. All existing requests will be aborted. Proceed?
ru: Во время выполнения Веб ГИС будет перезапущена. Все текущие запросы будут прерваны. Продолжить?

source: Web GIS is restarting, please wait...
ru: Веб ГИС перезапускается, подождите...

source: Custom
ru: Пользовательский

source: System
ru: Системный

source: Font
ru: Шрифт

source: Format
ru: Формат

source: Type
ru: Тип

source: Delete
ru: Удалить

source: Show system fonts
ru: Показать системные шрифты

source: The home path setting is saved.
ru: Настройка стартовой страницы сохранена.

# test
source: unit
ru: штука

source: Sign in
ru: Войти

source: Invitation session
ru: Сессия по приглашению

source: User settings
ru: Настройки пользователя

source: Sign out
ru: Выйти

source: Resources
ru: Ресурсы

source: Control panel
ru: Панель управления

source: Help
ru: Справка

source: We recommend height of 45 px and width of up to 200 px.
ru: Рекомендуемая высота 45 px и ширина до 200 px.

source: Only PNG and SVG images are supported.
ru: Поддерживаются только изображения PNG и SVG.

source: Measurement ID
ru: Идентификатор потока данных

source: Add
ru: Добавить

source: The setting is saved.
ru: Настройка сохранена.

source: Reload the page to get them applied.
ru: Обновите страницу, чтобы настройки вступили в силу.

source: Add one or more counters to your Web GIS.
ru: Добавьте один или несколько счетчиков в вашу Веб ГИС.

source: HTML code of these counters will be embeded into each page and will allow you to track user activity.
ru: HTML-код этих счетчиков будет встроен в каждую страницу и позволит отслеживать активность пользователей.

source: Tag number
ru: Номер счетчика

source: Webvisor
ru: Вебвизор

source: Google Analytics
ru: Google Аналитика

source: Yandex.Metrica
ru: Яндекс.Метрика

source: Some changes may be reflected only after full estimation.
ru: Некоторые изменения могут быть отражены только после полной оценки использования хранилища.

source: Storage usage was fully estimated at {f}.
ru: Использование хранилища было полностью оценено в {f}.

source: Storage usage was fully estimated at {f} and updated at {u}.
ru: Использование хранилища было полностью оценено в {f} и обновлено в {u}.

source: Storage usage hasn't been estimated yet but was updated at {u}.
ru: Использование хранилища еще не было полностью оценено, но было обновлено в {u}.

source: Storage usage hasn't been estimated yet.
ru: Использование хранилища еще не было полностью оценено.

source: Kind of data
ru: Вид данных

source: Volume
ru: Размер

source: Total
ru: Итого

source: of
ru: из

source: Estimate storage
ru: Оценка хранилища

source: Package
ru: Пакет

source: Version
ru: Версия

source: Platform
ru: Платформа

source: Browser support
ru: Поддержка браузеров

source: or higher
ru: или выше

source: Not supported
ru: Не поддерживается

source: Your browser
ru: Ваш браузер

source: Checking for updates...
ru: Проверяем наличие обновлений...

source: <a>Contact support</a> for update.
ru: <a>Обратитесь в поддержку</a> для установки обновлений.

source: Show details
ru: Подробнее

source: Critical updates are available: {version}. Please consider updating an soon as possible.
ru: Доступны критические обновления: {version}. Рекомендуем установить их как можно быстрее.

source: New version of {distribution} is available: {version}.
ru: Доступна новая версия {distribution}: {version}.

source: Your {distribution} is up-to-date.
ru: У вас последняя версия {distribution}.

source: The system name setting is saved.
ru: Настройка названия Веб ГИС сохранена.

source: Critical updates are available
ru: Доступны критические обновления

source: Updates are available
ru: Доступны обновления

source: Click to see what's new
ru: Нажмите и узнайте, что нового

source: Browser compatibility test
ru: Проверка совместимости браузера

source: %(name)s %(current)s supported
ru: %(name)s %(current)s поддерживается

source: Web GIS browser compatibility test has been passed! The Web GIS should work fine.
ru: Проверка совместимости браузера пройдена! Веб ГИС должна работать корректно.

source: %(name)s not supported
ru: %(name)s не поддерживается

source: You're using %(name)s although it's not supported by the Web GIS. It's an outdated browser lacking required features. Try a different browser or contact your system administrator if another browser isn't available.
ru: Вы используете %(name)s, хотя он не поддерживается Веб ГИС. Это устаревший браузер не обладащий рядом необходимых функций. Попробуйте использовать другой браузер или свяжитесь с вашим системным администратором если другой браузер недоступен.

source: %(name)s %(current)s not supported
ru: %(name)s %(current)s не поддерживается

source: You're using %(name)s %(current)s although it's not supported by the Web GIS. It's an outdated version lacking required features. Contact your system administrator for upgrading to %(name)s %(required)s+ or try a different browser.
ru: Вы используете %(name)s %(current)s, хотя он не поддерживается Веб ГИС. Это устаревшая версия браузера, не обладащая рядом необходимых функций. Свяжитесь с вашим системным администратором для обновления или попробуйте использовать другой браузер.

source: If you still want to continue using the current browser, click the link below to bypass the compatibility test. The Web GIS or some features may degrade or fail in this case.
ru: Если вы все же хотите продолжить использование Веб ГИС с текущий браузером, нажмите на ссылку ниже, чтобы пропустить проверку совместимости. Веб ГИС или часть ее функций могут работать некорректно в этом случае.

source: I understood but want to proceed at my own risk. Skip the test!
ru: Понятно, но я хочу продолжить на свой страх и риск. Пропустить тест!

source: Unknown browser
ru: Неизвестный браузер

source: If you are using an up-to-date browser the Web GIS should be fine.
ru: Если вы используете актуальную версию браузера, Веб ГИС будет работать нормально.

source: Parameter required
ru: Требуется параметр

source: The '{}' query parameter is required.
ru: Необходимо указать значение параметра '{}'.

source: Invalid parameter
ru: Некорректный параметр

source: The '{}' query parameter has an invalid value.
ru: Параметр запроса '{}' имеет недопустимое значение.

source: Malformed JSON body
ru: Некорректное JSON тело

source: The JSON body of the request is malformed or invalid.
ru: JSON тело запроса имеет некорректный или недопустимый формат.

source: HTTP API documentation
ru: Документация HTTP API

source: System information
ru: Информация о системе

source: Font management
ru: Управление шрифтами

source: Storage
ru: Хранилище

source: Backups
ru: Резервные копии

source: Custom CSS
ru: Пользовательские стили CSS

source: Custom logo
ru: Логотип

source: Web GIS name
ru: Название Веб ГИС

source: Home path
ru: Стартовая страница

source: Metrics and analytics
ru: Метрики и аналитика

source: Info
ru: Информация

source: Settings
ru: Настройки
